/**
 * 회원 탈퇴 관련 상수 데이터
 */

/**
 * 유의사항 목록
 */
export const WITHDRAWAL_PRECAUTIONS = [
  '회원탈퇴 즉시 회원정보는 모두 삭제되며, 재가입시에도 복원되지 않습니다',
  '루미클린을 탈퇴하시면 서비스 부정 이용 방지를 위해 일정 기간 동안 회원 재가입이 불가합니다.',
];

/**
 * 탈퇴 후 정보보관 설명
 */
export const WITHDRAWAL_INFO_RETENTION_DESCRIPTION =
  '회원탈퇴 후에도 전자상거래법 등 관련 법령에 의하여 일정기간 보관이 필요한 경우 아래와 같이 회원정보를 보관합니다.';

/**
 * 탈퇴 후 정보보관 항목 목록
 */
export const WITHDRAWAL_INFO_RETENTION_ITEMS = [
  '표시, 광고에 관한 기록: 6개월',
  '계약 또는 청약철회 등에 관한 기록: 5년',
  '대금결제 및 재화등의 공급에 관한 기록: 5년',
  '소비자의 불만 또는 분쟁처리에 관한 기록: 3년',
];
